#+title: Staging Step 3: Make a build script
#+date: <2023-03-14 11:57>
#+description: Step 3: Make a gerbil build script
#+filetags: Gerbil gxc Compile Module Library

** Build existing and test


#+begin_src sh :session state-stage3 :results verbatim :wrap example
  export STATE_CHAN_SRC=$(cd ../.. && pwd)
  export STATE_CHAN_BUILD=$STATE_CHAN_SRC/build
  cd $STATE_CHAN_SRC
  git pull
  $STATE_CHAN_BUILD gerbil
#+end_src

#+RESULTS:
#+begin_example

sh-5.1$ sh-5.1$ sh-5.1$ Enter passphrase for key '/home/drewc/.ssh/id_rsa':
From github.com:drewc/state-channels
upstream/main
Updating 4187e2d..cf86e68
Fast-forward
 BOOT.ini      |   6 +--
 src/procph.ss |   2 +-
 src/scm2js.ss | 120 ++++++++++++++++++++++++++++++++++++++++++++++++++++
 3 files changed, 124 insertions(+), 4 deletions(-)
 create mode 100644 src/scm2js.ss
mkdir: cannot create directory ‘sock’: File exists
../src/llioruntime.ss
../src/llruntime.ss
../src/socks.ss
../src/clish.ss
../bin/scm
../src/files.ss
../src/eth.ss
../bin/eth
../bin/solc
#+end_example

#+begin_src sh :session state-stage3 :results verbatim :wrap example
  cd $STATE_CHAN_SRC;
  bin/scm examples/mp1_1
#+end_src
#+RESULTS:
#+begin_example

Loading examples/mp1_1 from /home/drewc/me/MuKn/src/state-channels
host-fsock, "src/ipc.ss"@64.15 -- (Argument 1) STRING expected
(string-append
!void
 ":"
9
)
#+end_example

Well, that's new. I bet it's one of yesterday's commits as it somewhat worked with a previous build. So let us back up.

#+begin_src sh :results verbatim :wrap src text
  git log --pretty=format:"%h - %an, %ar : %s" -16
#+end_src

#+RESULTS:
#+begin_src text
cf86e68 - Drew Crampsie, 17 minutes ago : Merge branch 'MuKnSys:main' into main
4187e2d - Drew Crampsie, 18 hours ago : Stage 2. Look at the `doc/log`s
143b160 - HenriLesourd, 10 hours ago : Compiling to Javascript (0-2)
a28061b - HenriLesourd, 11 hours ago : Compiling to Javascript (0)
d22f4d5 - Drew Crampsie, 19 hours ago : Merge branch 'MuKnSys:main' into main
cba8c37 - Drew Crampsie, 21 hours ago : WIP: Port to JS Step 1. Look at doc/log/2023-03-13*
f8c15c7 - HenriLesourd, 21 hours ago : Extracting backends (8-5)
15c5982 - HenriLesourd, 21 hours ago : Extracting backends (8-4)
9ba69db - HenriLesourd, 21 hours ago : Extracting backends (8-3)
1ba5465 - HenriLesourd, 21 hours ago : Extracting backends (8-2)
5988db7 - HenriLesourd, 22 hours ago : Extracting backends (8)
5695e31 - HenriLesourd, 31 hours ago : Extracting backends (7)
fa98807 - HenriLesourd, 31 hours ago : Extracting backends (6)
a995721 - HenriLesourd, 32 hours ago : Extracting backends (5)
4ca935a - HenriLesourd, 2 days ago : Extracting backends (4bis)
fcfbd5b - HenriLesourd, 2 days ago : Extracting backends (4)
#+end_src

